maqconnectsolucoes/bitaxe-fix/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=2048
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WIFI_11KV_SUPPORT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_MAX_SOCKETS=26
CONFIG_LWIP_IPV6=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_USE_ESP_GETADDRINFO=y
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y

# Core dump to flash: the partition table already reserves a 64K coredump
# partition, but the feature was never enabled, so a panic left no backtrace
# behind (only a UART print that nobody was watching). Investigating the
# 2026-09-11 14:38 panic on two devices was impossible for exactly this reason.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
# Obrigatório aqui: o Kconfig do espcoredump avisa que "core dumps to Flash are
# not available if PSRAM is used for task stacks", e quase toda tarefa deste
# firmware nasce de xTaskCreateWithCaps(..., MALLOC_CAP_SPIRAM). Sem esta opção o
# handler tenta usar a pilha (em PSRAM) da tarefa que estourou e não grava nada --
# foi o que aconteceu no panic de 11/09 22:34, que deixou a partição em branco.
CONFIG_ESP_COREDUMP_USE_STACK_SIZE=y
# Range exigido quando USE_STACK_SIZE está ligada é 1792-4096; o 1024 anterior
# sequer era válido.
CONFIG_ESP_COREDUMP_STACK_SIZE=2048
